---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GroupFailures
source: html/c1f110fe-a94b-5ab6-f5fa-c1a0516c623f.htm
---
# BuiltInFailures.GroupFailures Properties

Grouping the selected elements requires that additional element(s) also be grouped. [Description]
 To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.